app/controllers/posts_controller.rb

SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
---
  def index
    # provide a list of authors to the view for the filter control
    @authors = Author.all

    # filter the @posts list based on user input
    @posts = if !params[:author].blank?
               Post.by_author(params[:author])
             elsif !params[:date].blank?
               if params[:date] == 'Today'
                 Post.from_today
               else
                 Post.old_news
               end
             else
               # if no filters are applied, show all posts
               Post.all